Revit 2027 API
RebarSpliceUtils.GetLapDirectionForSpliceGeometryAndPosition Method
 This function calculates the lap direction given a RebarSpliceGeometry and a RebarSplicePosition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ GetLapDirectionForSpliceGeometryAndPosition(
	Rebar rebar,
	RebarSpliceGeometry spliceGeometry,
	RebarSplicePosition splicePosition
)
Public Shared Function GetLapDirectionForSpliceGeometryAndPosition (
	rebar As Rebar,
	spliceGeometry As RebarSpliceGeometry,
	splicePosition As RebarSplicePosition
) As XYZ
public:
static XYZ^ GetLapDirectionForSpliceGeometryAndPosition(
	Rebar^ rebar,
	RebarSpliceGeometry^ spliceGeometry,
	RebarSplicePosition splicePosition
)
static member GetLapDirectionForSpliceGeometryAndPosition :
        rebar : Rebar *
        spliceGeometry : RebarSpliceGeometry *
        splicePosition : RebarSplicePosition -> XYZ
Parameters
rebar Rebar
 The input rebar.
spliceGeometry RebarSpliceGeometry
 The splice geometry.
splicePosition RebarSplicePosition
 The splice position.
Return Value
XYZ
 The lap direction.
Exceptions
Exception | Condition
ArgumentException |  RebarSplicePosition should not be Middle. -or- Free Form Rebars other than Morphed, or Shape Driven Rebars that are Multiplanar or have a shape whose definition is RebarShapeDefinitionByArc can't be spliced. Also, if the Rebar is member of a Group it cannot be spliced. -or- The rebar cannot be spliced with the provided RebarSpliceGeometry.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This function determines first the point where the RebarSpliceGeometry will cut the rebar. Based on the RebarSplicePosition value it will determine the direction where the lap will go, RebarSplicePosition.End1 meaning towards the start of the splice chain and RebarSplicePosition.End2 towards the end. For more information about the splice chain concept please check Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Rebar rebar). This function will throw exception if it's called with RebarSplicePosition.Middle.
See Also
Reference
RebarSpliceUtils Class
Autodesk.Revit.DB.Structure Namespace